<script setup>
import UserLayout from "@/components/layouts/UserLayout.vue";
</script>

<template>
  <UserLayout>
    <div class="columns-1 justify-center items-center w-full p-20">
      <div class="mb-8 text-center px-4">
        <h1 class="text-left text-2xl font-bold">
          การจัดฟัน คืออะไร มีกี่แบบ ครบทุกเรื่อง ที่คนยังไม่จัดฟันควรรู้ !
          <div class="divider m-0 max-w-2xl"></div>
        </h1>
        <p class="text text-justify my-5">
          <a class="text font-semibold">การจัดฟัน</a>
          สามารถแก้ไขปัญหาฟันไม่สวย ฟันหน้ายื่น ฟันซ้อน ฟันเก ยิ้มไม่มั่นใจ กัดฟันไม่ได้ ให้หมดไปได้ครับ ปัจจุบันการจัดฟันมีราคาที่ค่อนข้างหลากหลาย สามารถเลือกชนิดเครื่องมือได้ตามความเหมาะสม ตาม life
          style ของแต่ละบุคคล เช่น การจัดฟันเซรามิก จัดฟันแบบโลหะ จัดฟันแบบดามอน (damon) หรือจัดฟันแบบใส invisalign
        </p>
      </div>

      <div class="mb-8 text-center px-4">
        <h1 class="text-left text-2xl font-bold">
          การจัดฟัน คืออะไร !
          <div class="divider m-0 max-w-2xl"></div>
        </h1>
        <p class="text text-justify my-5">
          <a class="text font-semibold">การจัดฟัน (Orthodontics) </a>
          เป็นสาขาหนึ่งทางทันตกรรมเพื่อความงาม (cosmetic dentistry) คือการรักษาทันตกรรมเฉพาะทางสาขาหนึ่ง ในการวิเคราะห์ วินิจฉัยและวางแผนป้องกันรักษาความผิดปกติของการเรียงฟัน การสบฟัน
          รวมถึงปัญหาที่เกี่ยวกับขากรรไกรที่จำเป็นต้องสัมพันธ์กับใบหน้า เป็นการรักษาเพื่อให้มีการสบฟันที่ดีขึ้น การบดเคี้ยวอาหารมีประสิทธิภาพ
          ลดปัจจัยเสี่ยงในการเกิดฟันผุหรือโรคเหงือกอันเนื่องมาจากฟันเรียงตัวผิดปกติ ฟันซ้อนเกหรือแปรงฟันไม่ทั่วถึง และหลีกเลี่ยงการเกิดรอยสึกของฟันจากการเรียงฟันหรือการสบฟันที่ไม่เหมาะสม
        </p>
      </div>

      <div class="mb-8 text-center px-4">
        <h1 class="text-left text-2xl font-bold">
          ใครบ้างที่ควรจัดฟัน ปัญหาฟันแบบไหนที่ควรเข้ารับการรักษา
          <div class="divider m-0 max-w-2xl"></div>
        </h1>
        <p class="text text-justify my-5">
          การจัดฟันเหมาะสำหรับผู้ที่มีปัญหาเกี่ยวกับการเรียงตัวของฟัน การสบฟัน หรือโครงสร้างของขากรรไกรที่ผิดปกติ ซึ่งอาจส่งผลต่อสุขภาพช่องปากและบุคลิกภาพในระยะยาว หากคุณมีลักษณะใดลักษณะหนึ่งต่อไปนี้
          อาจะเป็นสัญญาณว่า ถึงเวลาต้องปรึกษาทันตแพทย์จัดฟันแล้วครับ
        </p>
        <ul class="list-disc list text text-justify my-2 mx-8">
          <li>ฟันซ้อนเก (Chowded teeth) : ฟันเรียงซ้อนทับกัน ไม่เป็นระเบียบ ทำความสะอาดยาก เสี่ยงฟันผุและเหงือกอักเสบ</li>
          <li>ฟันห่าง (Spacing) : มีช่องว่างระหว่างฟัน ฟันไม่ชิด อาจทำให้เศษอาหารติดและเกิดปัญหาฟันผุ</li>
          <li>ฟันยื่น (Protrusion) : ฟันหน้าบนยื่นออกมามากกว่าปกติ อาจกระทบต่อความสวยงาม และเสี่ยงต่อการกระแทก</li>
          <li>ฟันล่างคร่อมฟันบน (Anterior Crossbite): ฟันล่างยื่นออกมามากกว่าฟันบน ส่งผลต่อการบดเคี้ยวและรูปหน้า</li>
          <li>Scissor bite: ฟันหลังกรามบนล่างไม่สบเหลื่อมแบบไม่แตะกันเลย ลักษณะดังกล่าว ส่งผลต่อการสบฟัน เหงือกและปริทันต์โดยตรง</li>
          <li>ฟันสบลึก (Deep bite) : ฟันหน้าบนคร่อมฟันหน้าล่างมากเกินไปในแนวดิ่ง ส่งผลต่อการบทเคี้ยวและการสึกของฟัน</li>
          <li>ฟันสบเปิด (Open bite) : ฟันหน้าไม่สบกันเมื่อกัด อาจส่งผลต่อการออกเสียงและการเคี้ยว</li>
          <li>ขากรรไกรเบี้ยว หรือไม่สมดุลกัน (Skeletal Discrepancy) : มีผลต่อโครงหน้า ความสวยงาน และการสบฟันโดยตรง</li>
        </ul>
      </div>

      <div class="mb-8 text-center px-4">
        <h1 class="text-left text-2xl font-bold">
          การจัดฟันมีกี่แบบ ?
          <div class="divider m-0 max-w-2xl"></div>
        </h1>
        <p class="text text-justify font-bold my-5">รูปแบบชนิดของการจัดฟันแบ่งออกเป็น 2 ประเภทหลัก ๆ คือ</p>
        <ul class="list-disc list text text-justify my-2 mx-8">
          <li><a class="text font-semibold">การจัดฟันแบบติดเครื่องมือ</a> : เป็นการจัดฟันที่ใช้เครื่องมือยึดติดกับผิวฟันตลอดระยะเวลาการรักษา ต้องมาพบทันตแพทย์ตามนัดเพื่อปรับแรงอย่างสม่ำเสมอ</li>
          <li>
            <a class="text font-semibold">การจัดฟันแบบไม่ติดเครื่องมือ </a> : เช่น Invisalign ซึ่งเป็นเครื่องมือจัดฟันใส สามารถถอดเข้า-ออกได้
            เหมาะกับผู้ที่ต้องการความสะดวกและรูปลักษณ์ที่ดูเป็นธรรมชาติ
          </li>
        </ul>

        <p class="text text-justify font-bold my-5">การจัดฟันแบบติดเครื่องมือ มีกี่แบบ ?</p>
        <ul class="list-disc list text text-justify my-2 mx-8">
          <li>
            <a class="text font-semibold">จัดฟันแบบโลหะ Metal</a> : (ผ่อนเดือนละ 1,500) เป็นการจัดฟันที่ได้รับความนิยม โดยเฉพาะในกลุ่มวัยรุ่นและนักเรียน เพราะมีสีสันให้เลือกมากมาย
            และราคาย่อมเยากว่ารูปแบบอื่น เครื่องมือจะติดอยู่ที่ผิวหน้าของฟัน โดยมีลวดเป็นตัวให้แรง และยางโอริง (O-ring) เป็นตัวยึดลวดกับ bracket ซึ่งต้องมีการปรับเครื่องมือทุก ๆ 1 เดือน ขัอดี :
            ราคาเข้าถึงง่าย, ประสิทธิภาพสูง, ทนทานและแข็งแรง, ดูแลและปรับเครื่องมือได้ง่าย, เปลี่ยนยางสีได้ตามใจ เหมาะกับใคร: การจัดฟันแบบโลหะเหมาะกับนักเรียน นักศึกษา ที่มีงบประมาณจัดฟันจำกัด
            และผู้ที่มีเวลาสามารถมาพบทันตแพทย์ได้บ่อย ๆ ครับ
          </li>
          <li>
            <a class="text font-semibold">จัดฟันแบบเซรามิก Ceramic</a> : ( ผ่อนเดือนละ 2,100 บาท) จัดฟัน เซรามิก (Ceramic) เป็นการจัดฟันโดยใช้วัดสุแบบเซรามิกใส ที่ยึดติดกับผิวฟันด้านหน้า
            แล้วใส่ลวดผ่านร่อง Bracket และใช้ยางแบบใสรัดเครื่องมือจัดฟันให้ติดกับลวดจัดฟัน เพื่อช่วยควบคุมทิศทางการเคลื่อนตัวของฟัน มีสีใกล้เคียงกับสีฟัน มองเห็นเครื่องมือได้น้อยกว่าการจัดฟันแบบโลหะ
            ข้อดี: ความสวยงามและดูเป็นธรรมชาติ, วัสดุคุณภาพดี ไม่เปลี่ยนสีง่าย, แข็งแรงเพียงพอในการเคลื่อนฟัน, เหมาะกับบุคคลที่ต้องการภาพลักษณ์ดีระหว่างการรักษา เหมาะกับใคร: การจัดฟันแบบจัดฟันเซรามิก
            เหมาะกับผู้ที่ต้องการจัดฟัน แต่ไม่อยากให้คนสังเกตเห็นเครื่องมือชัดเจน เนื่องจากมีหน้าที่และบุคลิก ในการทำงาน คนไข้ต้องมาปรับเครื่องมือจัดฟันทุก ๆ 1 เดือน ใช้ระยะเวลาการจัดฟัน 2
            ปีขึ้นไปครับ
          </li>
        </ul>

        <p class="text text-justify font-bold my-5">การจัดฟันแบบไม่ติดเครื่องมือ มีกี่แบบ ?</p>
        <ul class="list-decimal list text text-justify my-2 mx-8">
          <li>
            <a class="text font-semibold">จัดฟันแบบใส Invisaliagn</a> : (ผ่อนเดือนละ 10,000 บาท ) จัดฟันแบบใส หรือ เครื่องมือ จัดฟัน Invisalign เป็นนวัตกรรมการจัดฟันล้ำสมัยที่ใช้ระบบสามมิติ 3D
            เข้ามาช่วยในการออกแบบฟันเฉพาะบุคคล ซึ่งช่วยให้คนไข้เข้าใจและมีส่วนร่วมกับแผนการรักษามากขึ้น ตัวเครื่องมือมีความใส สามารถถอดเข้า-ออกได้ ทำให้ดูเป็นธรรมชาติ เหมือนไม่ได้จัดฟันเลยครับ
            <ul class="p-4">
              <li class="my-4"><a class="text font-bold">ข้อดี</a> : แทบมองไม่เห็น, ถอดเข้า-ออกได้, วัสดุ SmartTrack เรียบและยืดหยุ่น, พูดชัด ไม่สะดุด, เห็นแผนการรักษาล่วงหน้า,</li>
              <li>
                <a class="text font-bold">เหมาะกับใคร</a> : เหมาะกับทุกวัย การจัดฟันแบบใสเหมาะสำหรับผู้ที่ต้องการความสวยงามสูงสุด ไม่อยากให้เครื่องมือส่งผลต่อภาพลักษณ์
                และสามารถมีวินัยในการใส่เครื่องมืออย่างน้อย 20–22 ชั่วโมงต่อวัน เพื่อผลลัพธ์ที่ดีที่สุดค่ะ การจัดฟันโดยเฉลี่ยอยู่ที่ 6-24 เดือน ขึ้นไปครับ สามารถแบ่งเป็น 3 ประเภทใหญ่ ๆ ดังนี้
              </li>
              <ul class="mx-4">
                <li><a class="text font-semibold">1.1 Invisalign i7</a> : สำหรับผู้ที่มีปัญหาเล็กน้อย เคลื่อนฟัน 1-2 มม. เครื่องมือไม่เกิน 7 ชุด</li>
                <li><a class="text font-semibold">1.2 Invisalign lite</a> : สำหรับผู้ที่เคยจัดฟันมาแล้วฟันล้ม หรือผู้ที่มีปัญหาฟันเล็กน้อย เครื่องมือไม่เกิน 14 ชุด</li>
                <li><a class="text font-semibold">1.3 Invisalign full</a> : สำหรับฟันทุกสภาพความผิดปกติ จำนวนเครื่องมือมีไม่จำกัด</li>
              </ul>
            </ul>
          </li>

          <li>
            <a class="text font-semibold">จัดฟันแบบดามอน Damon </a> : (ผ่อนเดือนละ 3,000 บาท) จัดฟันแบบดามอน เป็นการจัดรูปแบบใหม่ ไม่ต้องใช้ยางรัด (self lighting) ช่วยลดแรงเสียดทาน
            ทำให้ฟันเคลื่อนตัวได้เร็วขึ้น และสบายกว่าการจัดฟันแบบโลหะทั่วไป เหมาะกับผู้ที่ต้องการทางเลือกที่เจ็บน้อย ดูแลสะดวก และเห็นผลไว
            <ul class="p-4">
              <li><a class="text font-bold">ข้อดี</a> :</li>
              <ul class="mx-4">
                <li><a class="text font-semibold">2.1</a> การจัดฟันดามอน (Damon) ไม่ต้องใช้ยาง ดังนั้นจึงไม่มีปัญหาเรื่องยางขาด หรือยางเสื่อมสภาพ</li>
                <li><a class="text font-semibold">2.2</a> มีการใช้เทคโนโลยีแบบ Self-Ligating ลักษณะจะเป็นบานพับเปิดปิด ลดแรงเสียดทาน ส่งผลให้ฟันเคลื่อนที่ไว</li>
                <li><a class="text font-semibold">2.3</a> เจ็บน้อยกว่าการจัดฟันทั่วไป เพราะไม่มีแรงดึงจากยางรัด ฟันจึงค่อยๆเคลื่อนตัวไม่กระชาก และไม่กระแทก</li>
              </ul>
              <li class="my-4"></li>
              <li><a class="text font-bold">การจัดฟัน Damon มี 3 รุ่นคือ</a> :</li>
              <ul class="mx-4">
                <li><a class="text font-semibold">3.1 Damon Q </a> : เครื่องมือมีลักษณะเป็นโลหะ</li>
                <li><a class="text font-semibold">3.2 Damon clear </a> : เครื่องมือมีลักษณะเป็นแบบใส</li>
                <li>
                  <a class="text font-semibold">3.3 Damon Ultima (รุ่นใหม่ล่าสุด) </a> : เครื่องมือมีลักษณะเป็นโลหะ ที่พัฒนาระบบให้ลวดและแบรกเก็ตแนบสนิทมากยิ่งขึ้น เคลื่อนฟันได้แม่นยำกว่าเดิม
                  และลดแรงเสียดทานสูงสุด
                </li>
              </ul>

              <li class="my-4">
                <a class="text font-bold">เหมาะกับใคร</a> : หมาะกับทุกเพศทุกวัย โดยเฉพาะผู้ที่ต้องการเห็นผลลัพธ์ไว ปวดน้อย และดูแลสุขภาพช่องปากได้ง่าย นอกจากนี้ยังมีแบบใสให้เลือก
                สำหรับผู้ที่ไม่ต้องการเห็นเครื่องมือชัดจนเกินไป
              </li>
            </ul>
          </li>
        </ul>
      </div>

      <div class="mb-8 text-center px-4">
        <h1 class="text-left text-2xl font-bold">
          จัดฟันราคาเท่าไหร่ ?
          <div class="divider m-0 max-w-2xl"></div>
        </h1>
        <div class="overflow-x-auto">
          <table class="table table-zebra">
            <!-- head -->
            <thead>
              <tr class="text-center bg-purple-200">
                <th>ประเภทการจัด</th>
                <th>ราคา</th>
              </tr>
            </thead>
            <tbody class="text-center">
              <!-- row 1 -->
              <tr>
                <td>จัดฟันแบบโลหะ</td>
                <td>39,000 - 50,000</td>
              </tr>
              <!-- row 2 -->
              <tr>
                <td>จัดฟันแบบเซรามิก</td>
                <td>60,000</td>
              </tr>
              <!-- row 3 -->
              <tr>
                <td>จัดฟันแบบใส</td>
                <td>70,000 - 160,000</td>
              </tr>
              <!-- row 4 -->
              <tr>
                <td>จัดฟันแบบ Damon</td>
                <td>76,000 - 89,000</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>

      <div class="mb-8 text-center px-4">
        <h1 class="text-left text-2xl font-bold">
          วิธีการเตรียมตัวก่อนจัดฟัน มีอะไรบ้าง
          <div class="divider m-0 max-w-2xl"></div>
        </h1>
        <p class="text text-justify my-5">การเตรียมตัวก่อนจัดฟันเป็นขั้นตอนสำคัญครับ โดยทั่วไปควรเตรียมตัวตามขั้นตอนต่อไปนี้</p>
        <ul class="list-decimal list text text-justify mx-8">
          <li>
            เริ่มต้นด้วยการนัดพบคุณหมอเฉพาะทางจัดฟัน เพื่อประเมินสภาพช่องปากเบื้องต้น ถ่ายภาพ X-ray เพื่อดูโครงสร้างขากรรไกร ตำแหน่งของรากฟัน และแนวการสบฟัน
            เพื่อให้สามารถวางแผนการรักษาได้อย่างเหมาะสมกับแต่ละบุคคล
          </li>
          <li>เคลียร์ช่องปากก่อนการจัดฟัน เช่น ขูดหินปูน อุดฟัน ผ่าฟันคุด รักษารากฟัน หรือถอนฟันตามคำแนะนำ</li>
          <li>
            เตรียมความพร้อมทั้งร่างกาย ใจ และการเงิน การจัดฟันใช้เวลารักษาต่อเนื่อง 1-3 ปี ดังนั้นควรวางแผนเรื่องเวลา ความพร้อมในการมาพบแพทย์ตามนัดอย่างสม่ำเสมอ
            รวมถึงวางแผนการผ่อนชำระค่ารักษาให้เหมาะสมกับงบประมาณของแต่ละคน
          </li>
          <li>
            ฝึกแปรงฟันให้สะอาดมากขึ้น หลังติดเครื่องมือแล้ว ฟันจะดูแลยากขึ้น เพราะมีลวดและแบร็กเก็ตเข้ามาเกี่ยวข้อง แนะนำให้เริ่มฝึกแปรงฟันอย่างละเอียด โดยเฉพาะบริเวณซอกฟัน และแนวเหงือก
            เพื่อให้ชินก่อนติดเครื่องมือ
          </li>
          <li>เตรียมอุปกรณ์ดูแลฟันให้พร้อม ควรเตรียมแปรงสีฟันแบบจัดฟัน ไหมขัดฟัน ที่ร้อยไหม หรือ superfloss, interproximal brush เพื่อช่วยทำความสะอาดรอบเครื่องมือได้ดีขึ้น</li>
        </ul>
      </div>
    </div>
  </UserLayout>
</template>
